In [381]:
import pandas as pd
import numpy as np

In [382]:
score_df = pd.DataFrame([[1,50,80,70,'boy',1],[2,60,45,50,'boy',2],[3,98,43,55,'boy',1],\
                         [4,70,69,89,'boy',2],[5,56,79,60,'girl',1],[6,60,68,55,'girl',2],\
                         [7,45,70,77,'girl',1],[8,55,77,76,'girl',2],[9,25,57,60,'girl',1],\
                         [10,88,40,43,'girl',3],[11,25,60,45,'boy',3],[12,80,60,23,'boy',3],\
                         [13,20,90,66,'girl',3],[14,50,50,50,'girl',3],[15,89,67,77,'girl',3]],\
                        columns=['student_id','math_score','english_score','chinese_score','sex','class'])

In [383]:
score_df=score_df.set_index('student_id')
score_df

            math_score  english_score  chinese_score   sex  class
student_id
1                   50             80             70   boy      1
2                   60             45             50   boy      2
3                   98             43             55   boy      1
4                   70             69             89   boy      2
5                   56             79             60  girl      1
6                   60             68             55  girl      2
7                   45             70             77  girl      1
8                   55             77             76  girl      2
9                   25             57             60  girl      1
10                  88             40             43  girl      3
11                  25             60             45   boy      3
12                  80             60             23   boy      3
13                  20             90             66  girl      3
14                  50             50             50  girl      3
15                  89             67             77  girl      3

In [384]:
#找出全年級各科成績最高分與最低分?
for i,j in zip(['math_score', 'english_score', 'chinese_score'],\
               [score_df.math_score, score_df.english_score, score_df.chinese_score]):
    print('%s | maximum: %.2f & minimum %.2f'%(i[:-6].upper(), j.max(),j.min()))

MATH | maximum: 98.00 & minimum 20.00
ENGLISH | maximum: 90.00 & minimum 40.00
CHINESE | maximum: 89.00 & minimum 23.00

In [385]:
#找出數學班平均最高的班級?
temp_group = score_df.groupby('class').mean()
for i in range(len(temp_group)):
    if temp_group.iloc[i]['math_score']==temp_group['math_score'].max():
        print('Class %s has the highest average math score.' %str(i+1))

Class 2 has the highest average math score.

In [386]:
#分析全校女生與男生國文平均差幾分?
temp_group = score_df.groupby('sex').mean()
round(temp_group.english_score.max()-temp_group.english_score.min(), 2)

6.94